{
  "backend/main.mo": "Main Motoko actor implementing user profile management with role-based access control (admin/user permissions) and a public contact form submission system with admin-only viewing of submissions.",
  "feature_evidence.json": "Feature evidence report documenting four admin login authentication features (REQ-32 through REQ-35) involving AdminAuthGuard, useAuth hook, and AdminLogin page components.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including pages, components, hooks, and styling with focus on construction company website features and admin authentication flow.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes with neutral grayscale palette.",
  "frontend/index.html": "HTML entry point for Simran Enterprises Website with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "TanStack Router configuration defining seven routes (Home, About, Services, Gallery, Contact, Admin, AdminLogin) with Layout wrapper and router provider setup.",
  "frontend/src/components/admin/AdminAuthGuard.tsx": "Authentication guard component that checks isAuthenticated from useAuth hook and redirects unauthenticated users to /admin/login with current path as redirect parameter.",
  "frontend/src/components/admin/ContactDetailDialog.tsx": "Dialog component displaying full contact submission details (name, phone, email, message, timestamp) with formatted date and clickable contact links.",
  "frontend/src/components/admin/ContactsTable.tsx": "Admin table component for displaying contact submissions with search filtering, sortable timestamp column, and row click to open ContactDetailDialog.",
  "frontend/src/components/contact/ContactForm.tsx": "Contact form component with name, phone, email, and message fields that submits via useSubmitContact hook and displays success state with toast notifications.",
  "frontend/src/components/contact/ContactInfo.tsx": "Displays company contact information (phone numbers, email, address), WhatsApp chat button, and business hours in card layouts.",
  "frontend/src/components/contact/MapEmbed.tsx": "Embeds a Google Maps iframe showing the company location in Ambernath with address details.",
  "frontend/src/components/gallery/ImageGrid.tsx": "Grid display of project images with hover effects and click-to-open dialog for full-size viewing, showing project title and category badges.",
  "frontend/src/components/home/AboutPreview.tsx": "Home page section introducing Simran Enterprises and owner Sandeep Paswan with an image and call-to-action button to the about page.",
  "frontend/src/components/home/HeroSection.tsx": "Full-width hero banner with background image, headline, tagline, and call-to-action button linking to the contact page.",
  "frontend/src/components/home/ServicesHighlight.tsx": "Grid of service cards (residential, commercial, interior, renovation, civil) with images and descriptions that navigate to the services page on click.",
  "frontend/src/components/home/WhyChooseUs.tsx": "Four-column feature grid highlighting company strengths (quality, experience, timeliness, satisfaction) with icons and descriptions.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with company info, contact details, social media links, copyright notice, and caffeine.ai attribution.",
  "frontend/src/components/layout/Header.tsx": "Navigation header component with logo, desktop/mobile menus, and conditional Admin link for authenticated users. Uses TanStack Router for navigation and Sheet component for mobile menu.",
  "frontend/src/components/layout/Layout.tsx": "Main layout wrapper component that renders Header, Footer, and an Outlet for nested routes in a flex column structure.",
  "frontend/src/components/services/ServiceCard.tsx": "Service display card component with alternating image/text layout, showing title, description, and feature list with checkmarks.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control with admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAuth.ts": "Zustand store for admin authentication with hardcoded credentials (admin@gmail.com/Admin@92505), persisted to localStorage, providing login/logout functions and auth state.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing identity state, login/logout flows, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for contact form operations: useSubmitContact mutation to submit contact data and useGetAllContacts query to fetch all contact entries from the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom teal-based color scheme for light/dark modes, typography settings using Inter font, and utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/About.tsx": "About page displaying company information, founder Sandeep Paswan's profile with portrait, location details, and mission/vision/values sections with icons.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page protected by authentication, displaying contact form submissions in a table with logout functionality and loading/error states.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page component with email/password authentication form, redirects authenticated users to admin dashboard, displays company branding and features list.",
  "frontend/src/pages/Contact.tsx": "Contact page component that renders ContactForm, ContactInfo, and MapEmbed components with heading and description.",
  "frontend/src/pages/Gallery.tsx": "Gallery page displaying a grid of project images across categories (Interior Design, Residential, Commercial) using the ImageGrid component.",
  "frontend/src/pages/Home.tsx": "Home page component that renders HeroSection, AboutPreview, ServicesHighlight, and WhyChooseUs sections in sequence.",
  "frontend/src/pages/Services.tsx": "Services page displaying five service offerings (Residential, Commercial, Interior, Renovation, Civil) with detailed descriptions and features using ServiceCard components.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both regular and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended animations, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata defining Simran Enterprises website architecture, features, known issues (login not working), and business details including GST number and admin credentials."
}